[{"title":"最初的你还在么？","date":"2016-05-27T13:21:21.000Z","path":"story/最初的你还在么/","text":"没有人能一路单纯到底，但要记住，别忘了最初的自己。 心情不好时，闭上眼，告诉自己，这是幻觉。 我有一个的愿望，就像别人说的那样：没心没肺，人活百岁，问心无愧，做人不累。本以为，按照自己所想的方式，这些就会变得容易起来。能够放下浮躁的心，撇开一切的影响，坚持把一件事做下去，不忘初心，多好。所有的所有，慢慢的开始变得艰难起来。人的一生，你将无法预计可以遇见多少人，与怎么样的人相处，有多少事与他们关联着。哪些是你喜欢的，哪些是你讨厌的，甚至厌恶的。一切无法知晓。某天，你终要一个人去面对的。 ♢♢♢ 最近的一段时间，我深深地陷入苦恼中。我觉得自己要疯了，特别讨厌自己暴躁地发脾气。小D，其貌不扬，工作还算认真，是我公司的一个同事。刚开始相处时，还是挺好的，共事也愉快。时间久了，小D慢慢地暴露一些恶习。我开始发现，他这个人很喜欢吃别的同事零食。只要是同事办公桌上可以看得到的可以吃的东西，他随手一抓就往自个嘴巴里放，完全不经人家同意，就当自家似的。我是个比较爱带点零食回办公室的人，比如饼干、糖、水果等，因为我在公司午饭有时候吃不饱，下午一饿就可以拿这些来充饥。当然我是个爱分享的人，有吃的总会分给同事们的。有好几次我发现带来的零食，自己还没吃，就不见了，就剩下个袋子，觉得奇怪。有一天我发现，原来是他全偷吃了。如果他堂堂正正来问我要，我完全可以给他吃的，我还会觉得他是一个有礼貌的人。可为什么非要做出如此龌龊行为？我很难理解。小D一直说自己不买零食，坚决说自己并不喜欢吃零食。他自己却常常吃别人的零食吃最多，都不想想别人自己买的还没吃，全被他吃光了。你跟他说道理，完全不管用。就连饭菜，也会用舌舔过的筷子顺手夹别人的吃。他还会反驳你，说大家都很熟了，不介意的。得了便宜，还不买乖。我开始苦笑。后来我已经怕他了，越发少往公司带吃的了。 ♢♢♢ 我是个保守的人，不喜欢和别人过度开露骨的玩笑，更是厌恶一个男性没资本还轻佻浮夸毫无距离磨蹭女性。我相信每个人心底都有自己不可触碰的底线，就像一条导火线，点着了，一定会炸起来的。小D很爱说话，整个办公室就他话唠，众愤。我并不喜欢和他说话，总生怕一不小心就被他拉下素质的水平来。这是很恐怖的事。小D在办公室一唠叨，我觉得他就像一个苍蝇，还经常在我头顶嗡嗡飞的那种，闹心的烦，总想逮个机会一巴掌拍死。除了工作上的事，很多时候，我总会无视他，甭搭理他。前两周，他刚和一个谈了两个月左右的女孩分手。他谈过几个女孩，好似都没成。他谈女孩都是很装，装有钱，装好男人，最初并非诚心。久了，本性暴露了，多是女性提出分手。每次失败他都在埋怨女孩那方不懂事，在背后狂骂的哪种，还专到我耳根嘀咕，这一刻我总想把他踩到鞋底下。多恋败仗，自身问题。成与不成，人品问题。长不长久，诚心问题。可他说着说着，激动了，说到我头上来了。我一头雾水。莫名奇妙的开玩笑，我故意给他台阶下，而他还不知趣，趁势而上。而且老戳我，再加上某些言语彻底把我底线击垮，就这样我们在办公司肆无忌惮地吵了起来。“不顾及别人感受是自私，太顾及别人感受是自虐”。很多时候我是后者，今时我更愿意是前者。 ♢♢♢ 小D还是个不注重卫生的人。他在办公室的座位地板都是污迹斑斑的，桌面凌乱不雅，就连经常用的东西都粘灰。我是个爱干净的人，觉得他很脏，多次友善提醒他注意维护公共场所卫生清洁，屡次不听。每次经理看到脏，总批评说我工作失职，没管理好办公室环境卫生。我一肚子憋屈，不知道多少次叫他本人把自己桌子收拾干净、整齐，从来不听，也不去做。他这个人时不时轻浮挑逗你，嬉皮笑脸忽悠人，一脸的不尊重人。我看不惯，肚子就会积火。我的脾气变得越来越暴躁。我的声音变得越来越大声。久而久之，忍不住了就会吵起来。德国作家席勒曾说：“不尊重别人的人，别人也不会尊重他”。当初的种种好，我现在都是不以为然的。一个不尊重你的人，对他所做的事或许都是徒劳无意义的。 ♢♢♢ 在社会上工作越久，你会发现职场里的人就像河水，有深，有浅，有净，有脏，你要懂得从容。还要熟悉一些职场潜规则，逼自己学会保护自己。今年1月份，我去上海总部开总结大会，开会内容主要是针对2015年所有财务数据、费用以及销售业绩的总结，制定来年工作的计划。我清楚的记得自己在大会上发言，当时特紧张，准备了一个多月的言稿，即使练了好多次，依然不够淡定。我却装着应付裕如的样子，呈现完整的发言内容，完毕后松了一口气。这个时候的感觉就像会领奖一样，台下响起雷鸣般的掌声，总经理还不停的夸奖。看到这一切，似乎都很美好，内心仿佛在翩翩起舞。事后，我怎么也没想到，我会被经理找去训话。我无法理解当所有的人都在赞扬你的时候而经理否定你的这一行为。我希望在公司好好的工作，发现了问题，就该说出事实，提出建议方案，大家共同把问题解决，提高工作效率，让公司发展更好。而且党的思想基本路线都在提倡：一切从实际出发,理论联系实际,实事求是,在实践中检验真理和发展真理。我只不过是说出了事实，经理说我字眼针对某些同事，态度激烈。我有口难辩。我完全没有针对任何同事，心里感到很委屈。我开始怀疑公司领导、同事对我的称赞，这个地方飘着一层雾，看不清。社会真的可以历练一个人，吃过亏，受过委屈，就会学到一些东西，人也就成长了。很热播的一部剧《欢乐颂》，有一集是说小邱和白主管在公司翻脸的事，剧中人物设计的渣男白主管因为感情失败产生一种刁难捉弄可爱的小邱的发狠心态，好几次都不给小邱报销她部门经理出差的费用。最终逼得傻萌的小邱当着领导、同事的面暴出了白主管一直以来的财务数据不真实，假公济私暗中捞取便宜的而工作不负责任的一面。后来白主管被开除，我大快人心，觉得小邱有勇气说出事实，做得很好，公司就该表扬。可谁也没想到剧情中的小邱被公司辞退了。你会蓦然地发现，职场作为人生的演绎，有很多你需要去悟透的潜规则，用技巧性地去战斗、去奋斗、去成功。长大后才发现，有时候你说了真话，你还得和人家道歉，因为你戳穿了事实。所以想要活得顺畅，请时刻带上脑子。 ♢♢♢ 我现在觉得微信是个好玩意。每次职场遇到不顺、恼火、忍受不了的事情，我就会在微信里找朋友吐槽。只有诉说出来之后，心里才是舒服的。很多朋友说，出来社会工作久了都会发现一个共同的问题，就是会感觉到当初自己一味对别人好，受伤的很多时候是自己。很多发生在电视剧剧情中所安排的事，原来没有人安排，这些还是会发生在我们身边的。闺蜜也认真的对我说：“人真的会变，我也不是当初的自己了。社会真的会改变一个人”。我不想去表态这些残忍的现实。在这里我想借用季羡林的话：好多年来，我曾有过一个“良好”的愿望，我对每个人都好，也希望每个人都对我好。只望有誉，不能毁。最近我恍然大悟，那是根本不可能的。有时候，善良要有底线，大方要有原则。不分青红皂白只知道对人好，那么会辜负自己的一片好心。最后，我想用德高望重的杨绛先生的话来来收尾：“在这物欲横流的人世间，人生一世实在是够苦。你存心做一个与世无争的老实人吧，人家就利用你欺悔你。你稍有才德品貌，人家就嫉妒你排挤你。你大度退让，人家就侵犯你损害你。你要不与人争，就得与世无求，同时还要维持实力准备斗争。你要和别人和平共处，就先得和他们周旋，还得准备随时吃亏”。保留当初的善良与纯真，坚守着自己的原则。这是多么难能可贵的东西！","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/wwjlife/tags/随笔/"},{"name":"初心，小故事","slug":"初心，小故事","permalink":"https://github.com/wwjlife/tags/初心，小故事/"}]}]