[{"title":"花开即死亡，凋零且重生。","date":"2017-01-14T11:38:21.000Z","path":"随笔/花开即死亡，凋零且重生。/","text":"她说：“妹妹漂亮得像大家闺秀，说话好温柔，文艺女青。”我说：“还好。”她说：“妹妹年轻真好，快快乐乐的，老可爱了。”我说：“姐姐看起来一点不老。”她说：“南方的女孩都像你这样会穿衣麽？以前妹妹穿得很甜美，现在穿得时尚很潮有范，可惹人爱了。”我说：“不是的，姐姐也可以更美。” 我给她取了个英文名字Anne，善良，优雅，善解人意，热情帮助他人，很适合她。她比我大13岁，可年龄的差距并没有影响我们成为无所不畅谈的朋友，相见恨晚。Anne，是我见过最细软却又最勇敢的女人。 去年11月份，我和她一同入住上海新悦大酒店。我们一拍即合订好时间去上海外滩看夜景，准备逛逛上海街。可后来由于各种原因，各种牵制和顾及，最后都没有去成。于是，我们从苏州太仓直接打车回新悦大酒店。我们泡好澡，早早躺上床。就那种标间双人床套房，累了一天的我们，各躺一床，柔软得很舒服。我们没有睡意，也不想看电视，手机充电，就聊天，说了很多很多话。她把多年藏在心底最深处的故事说给我听。她说从来没跟人家提过，不知道为什么就想说给我听。我想，她真诚，她信任我。活在这个世界上，被人信任，就是最极致的开心。那一晚，她和我说她的感情史了。吸引女人，似乎最简单最好的方式是给她们讲你痛苦的过去。 高中的时候，Anne家境就很好，穿着如同公主，人不仅美丽，而成绩也优秀。她有一个发小，是个男孩。两人感情特别好，彼此爱慕对方，可谁也没去捅破那一层薄纸。可喜欢上一个人，用情过深，堆积越满，总有一天会由心从口而溢出。这个好像是定理，只是每个人采取处理的方式不一样。Anne，采取写信的方式告诉男孩，纸薄情深。她满怀期待，只换来男孩简单的一句：我配不上你。Anne说：“十年了，我喜欢的是他这个人，跟钱跟任何东西都没关系！”她觉得男孩不需要在意那些玩意，所以她不放弃追求男孩。 那年，男孩去了北京。她原本可以不去北京的，可男孩在那。她为了他，什么都不顾，自己一个人跑去北京找男孩。朋友们接待了她。那晚她躺在房间里睡觉，朋友们以为她累了睡着了没有叫上她聊天。她们就在厅外聊天，有聊到关于那男孩的事。她没睡着，隐隐约约听到男孩已经有女朋友了，而且还是大家认识的女孩，唯独她一直不知道。男孩不直接是因为没有勇气告诉她有女朋友了？怕她伤心不忍告诉？还是因为其他事来不及对她说？也许都有吧。十年时间的专情，她这刻心情谁能懂？那一刻就像一把螺丝刀在一刀一刀钻她的心窝，很痛很难受，又得忍。她去之前没有提前向男孩说，也没有跟朋友们说，就想给他一个大惊喜。可男一号都不在了，所有为他做的事都没有意义了，不重要了，其他的对她来说无关痛痒。后来，她离开了。 2000年，她难受，无处诉说。大晚上的，一个人跑上没有人逗留的教学楼，站在最顶处。寒风呼啸作冷，漆黑无光的环境，她都不怕了。她想跳楼却因为念及父母而没有迈出那一步，就一个人蜷缩在墙边泪如尿崩，心如刀绞。一个人成长的路上，难免偶遇心碎，总要坦然接受悲伤和失去，好像不溅点血，都不叫人生。后来，发小和那个女孩结婚了。她，祝福发小。从头到尾，她都没有吵过，很安静，温顺得让人十分心疼。 有人说，让一个人走出前任的悲痛，无非就两种：时间和新欢。如果不行，那只能怪时间不够长，新欢不够好。大学期间，Anne又恋爱了，做着所有恋人都会做的幸福事。她说那段日子里很开心，因为男生对她好。男生就像阳光，晒掉了她的所有不值得的悲伤。 还没毕业，在她完全没有准备的情况下，男生草率地带了她回家见了家长。在这之前，男生并没有和她商量过。女生第一次见家长，会特别紧张，很重视却不知所措。无论是着装还是言语举止，稍有不好，印象分大跌，家长会不喜欢的。男生好像从来没考虑过女生在这方面的感受，完全惯着自己的心意来。我想带回家就带回家，反正是我爱的人，父母会喜欢的。可男生有时候就是太高估了自己，从而低估了父母对自己的择偶要求，受到伤害的总是女生。是的，男生父母并不喜欢Anne，根本不会让她有当儿媳妇的机会。男生父母早已经安排了一个相亲的女孩，那女孩家境特别好，高官贵人，在物质上可以给予男方更多。父母要求男生和那相亲女孩结婚，说这一切都是为了男生的未来好。很多人会说，男生如果够爱女生，就去和父母协商努力争取在一起，毕竟两个能相爱不容易。公平的想法是这样的，可在这个社会公平的秩序里必须接受不公平的事实，那就是天底下并不是所有的父母都能做到深明大义，都能理解自己的子女。男生愿意去与父母协商，不同意，争执吵架，周旋得毫无招数招架住。最终，男生妈妈以死来要挟他。男生再爱她，也无法忍心将自己亲生父母的生死扔在一边完全不顾。这不是孝顺，而是亲情被逼绑架而不得不去做的事。 这一切，Anne看在眼里，痛在心里。她爱他，可并不是那种夹带着亲人生死威胁的自私爱，更不想让他夹在中间难受。于是，他们彼此共同商量决定分手。男生在父母的强逼下娶了相亲的女孩。第二年，他们就生了个孩子。可男生根本不爱那女孩，两年来过得并不好。 2003年，Anne得了抑郁症。她把整颗心都掏给了男生，一无所有。一个人的心就好像宝库，一下子掏空了，就会破产。沉重的打击，让她彻底崩溃了，生无可恋。她把自己关在黑暗不见光的房子里，不见任何人，不吃饭不洗澡，对所有的事物都失去兴趣，每天等死的节奏。这种感觉，就像骨架被抽走了，只剩下一摊肉。实在饿了，受不住了，她晚上就去厨房冰箱那一拿些馒头回房啃。漫长的夜里，每天也只有冰冷的馒头肯与她相伴。家人也劝过，说教过，一切都无济于事。难过就是难过，所有的安慰都显得没用。以前Anne的妹妹觉得她美丽自信懂事，会很甜蜜很亲昵地叫她姐姐。可看到现在暗淡无光自暴自弃身体发臭头发凌乱的她，从那一刻起再也没叫过她一声姐姐了。Anne对第二任花光了自己所有的感情，就像把存款花光了一样得不到人家的原谅。 半年后，她突然想看到阳光，拉开窗帘的那一刻，眼睛刺得睁不开。这是她躲在黑暗房子那么久之后，第一次感受到阳光的温暖。虚空极尽莫能计，每心旁总有情长，人随水去泪汪汪，唯见阳光满希望。她开始出去接触人，发现自己没有了朋友。她想与人沟通，发现自己失声了，不会说话了。她心里并没有完全放下第二任，但她不想再荒废人生，她想重拾生活的信心，感受美好的事物。她开始重新学说话，重新做事情，就期待一天能变好。后来，她去了上海工作。 每次出差到一个城市，她都会去电话亭打一个电话给第二任，不说话，就是为了听到他“喂”的那一声熟悉的声音，然后挂掉。所有传闻里陈词滥调的故事，你不见了，我才如此想念。她说，她习惯了打电话给他。一个人坐车，一个人喝酒，一个人哭着把故事往肚里咽，一个人整夜不睡觉睁眼看着天由暗变亮。她害怕黑夜，她也知道不管多害怕，终究有一天还是要醒来。 Anne说，第二任去过上海找过她，在上海霓虹红绿灯大街大吵过，两人就那样坐在路边嚎啕大哭。男生离婚了。他诉说没有她的日子里，没法过好。他后悔了。 Anne说，她当初就认定第二任是她这辈子对的人，是能给她永久心安的人。她叹气说：“感情，不是一人惜，而是两人守。”对于第二任的百般请求，她说换做以前会答应，可现在不会了。过去的回不来，只有一路向前。 其实，不止第二任过得不好，就连发小也后悔了。后来发小也跟她联系过。发小当初也喜欢她，只是觉得自己无论家境还是外貌都配不上，并不想伤害她。他觉得公主就该配王子，像他这样的普通骑士只适合出现在公主需要帮忙的时刻，一辈子的伴侣根本不敢高攀。错过好的女孩，男生就算悔恨，也晚了。 再后来，Anne也谈过两三次感情，可都没如她所愿。不是说Anne不好，或者忘不了谁，她很清楚自己需要什么，所以情愿宁缺勿滥。每个女孩的情感史都像一部剧，有男一号，有男二号，或者有备胎。女孩在戏里总会认真用心努力去演好女主角的角色，可并不是所有的结局都如人所愿。好的剧总能让人记很久，不好的剧总有一天会慢慢会淡出人的记忆，甚至遗忘它。从Anne的身上，我感觉会学到很多。得不到的就不要，不是好的就扔掉，我们应该在薄情的世界里，深情地活着。 她静静地向我说着她的故事，温和细语，并报以微笑。她是个柔软的人，我喜欢和她交谈。一个人之所以变得柔软，一定是她懂得了理解和宽容。对于自己不曾了解的事情学会的缄默，而不是横亘大吵用恶言相对，哪怕是不同意许多事情，但也学会了站在对方的立场上想问题。没有了非此即彼，非黑即白的执拗，学会了打开心胸，不止对现在，也对过去那些曾经难以搁置的顽念，学会了释怀。从头到尾她都没有指责过任何伤害过她的男生，她说站在对方的立场上想想，就会理解，心里就会坦然了，也就没那么难受了。我想，一个人不应该只会忍让，忍到无法再忍就会自燃爆炸，搞不好就会殃及他人。人应该学会包容，包容能让大家走得更远。 听完Anne的故事，我觉得那些说不再相信爱情的人有点搞笑。因为心有繁花，才满眼春色呀。我笑着说：“姐姐这么好，你会遇到对的那个人，不是一时强烈的心动，而是永久的心安。”Anne说：“我现在祈求活着就不错了！哈哈，不过，能再有爱情好像也不错，总会有的。”有些时候人必须要做自己的英雄，就像你以为那些说离不开你的人并不是真的离不开你，当某天他们真的离开你以后当你经历过这些伤痛以后，待人真诚以及拥有继续珍惜爱人的能力，这就是最勇敢的。这，就像Anne一样的勇敢。 Anne虽然还没等到爱情，可她现在的日子过得如花一样。她有很多朋友，城里城外的，省内省外的，国内国外的，不再孤单一人了，起码有朋友的陪伴。在很多人眼里，她是个大龄剩女。可她没有为此烦恼，她认为人就该活在当下好好享受生活就足够了。过去回不去，未来无法预测，只有当下才是最真实的。当然，她能活得这么好，都离不开一个好家庭的支持与爱护。Anne很爱她的爸爸，因为她爸爸很尊重她，从来不给她施加任何压力，只要她开心就好。一个父亲能把女儿照顾得像花一样，倾心尽情呵护，维持花的美好，一定是上辈子的情人。 Anne喜欢柔和粉色的鲜花，屋子里总有一束。平时没事，总爱罢弄一些小盆栽植物。她爱花，也养花，别致，高雅，性情温和，贤淑。白岩松曾说：“生活5％是幸福的，5%是痛苦的，剩余的90％是平淡的。”就像Anne的性格注定她成不了什么女强人，但她有自己的思想，能保持自己的原态，不被各种束缚“优化”。美丽的容颜会老去，但养花的女人，随着时间的流逝，心不会变老，只会沉淀出更多的成熟，更丰富的体验，更深刻的思想。我很喜欢她的那种与世无忧的生活状态，拥有少女心。毕竟，在浮躁的社会中能够沉淀自己平静内心的人并不多了。 除此以外，她很喜欢收藏高脚酒杯。懂喝酒的人都会知道一个常识，高脚酒杯是用来盛放红酒或者香槟酒的，而这种酒杯最能展示女人手部优美的线条。以前我从不喝酒的，可我也喜欢上了红酒，因为走心的高脚酒杯，情调，高雅。闲时，她会喝点酒，做做菜，看看书，也会宅在家看戏子。内心充盈的女人，总能把生活过成诗。 我和Anne年认识两年多了。她叫我妹妹，我叫她姐姐。她在北京，我在广州。她说我笑得可爱，我说她活得漂亮。 她，就像一朵不老的花。我认识的Anne，即使凋零死了，也会重生得很美丽。 晚安，好梦。你，和全世界。♡♡♡","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/wwjlife/tags/随笔/"},{"name":"游记","slug":"游记","permalink":"https://github.com/wwjlife/tags/游记/"},{"name":"吃货","slug":"吃货","permalink":"https://github.com/wwjlife/tags/吃货/"},{"name":"教程","slug":"教程","permalink":"https://github.com/wwjlife/tags/教程/"},{"name":"小故事","slug":"小故事","permalink":"https://github.com/wwjlife/tags/小故事/"}]}]