[{"title":"得一宠密，人生足矣","date":"2017-01-16T14:38:21.000Z","path":"随笔/得一宠密，人生足矣/","text":"你信不信有一种感情，一辈子都不会输给时间 这个时代女性有特别要好的女性朋友，都管叫闺蜜。没有任何的血缘关系，但她们会彼此信任，相互依偎，相互眷顾，无话不说，能玩能闹，可亲可抱，温暖懂你，不离不弃，能6得飞起，一起企盼未知。总之，有闺蜜就是棒。这种微妙的关系，她们都愿时光不老，永远不散。 今晚，我想聊聊关于我和宠蜜的那些事儿。宠蜜，就是宠爱我的闺蜜，我宠爱的闺蜜。在那么多闺蜜中，唯独她，我最宠。我知道做人要懂得雨露均沾，可我没办法不留点私心宠爱她，因为她对我实在是太好了。Burning Red，我的宠蜜。羡彼之良质兮，冰清玉润，腮凝新荔，眼有灵，唇不点而红，眉毛不画而美。她不化妆，比起那些每天香粉胭脂的女孩，自然是她最大最美的招牌。世人皆看她胖瘦，我独悦她真心。 那一年，高一刚开学不久，我与ZML，简单认识，不熟。记得有一次，三更半夜，黑灯瞎火的，我起来上厕所，发现自己的双腿不能动了，站不稳，就趴在床边哭。当时宿舍里的人全都在熟睡，只有对面床的她被惊醒。她看我在那哭，悄悄走过来细声问：“你怎么了，不舒服麽？”我说：“腿痛不知道怎么办。”她很快地回到自己的床，并从盒子里拿了一瓶药油出来，叫我平躺在床上把双腿放松伸直，很熟练地帮我擦药油，揉腿，拍打血管筋脉，很舒服，疼痛也减轻许多。她问：“你是不是走了很多路，有可能是累着了腿。”我说：“是，昨天跟着同学在市里逛了。”那一晚，她趴在我床上帮我揉腿，直到我安然熟睡，她才放心回去睡的。第二天我一醒来，看到她的黑眼圈，感动，温暖，一辈子忘不了。从此，我们就成了朋友。 2011年，我上大学，她复读。家里电话换了，手机号也换了，也没有网络账号，我无法联系上她。整整两年多，她失去音讯，一切我无从所知。那段时间，我从来都没有忘记过她，有时候会想她，就看她以前给我写的信，怀念我俩在一起的时光。后来很偶然的，有个以前的同学加了我qq，就聊天说起她，那同学有她qq，我就这样找到了她。她很快就来到了我学校找我，她见到我很激动。她说这些年她来晚了，抱歉让我等了那么久。她说她不知道我们同城居然离得这么近。她说不应该贪玩有了新朋友就忘了旧朋友。她说了很多，我安静地听着。大三那年，与她重逢，我乐得像个孩子笑得嘴巴合不上。那一天，我和她，一人坐一张小木凳子，各自手里捧着一杯白开水，一聊就一整天。真正的朋友，是不需要时刻调好闹钟般保持联系的，即使很久不见，坐下来也可以随便聊起来，连一声客气的话也不用道，挽起袖子边喝边说“我跟你讲啊”，仿佛许多年前不过是昨天。 现在，我和Burning Red都已经工作了。很幸运，我们同城。她一如既往的好，每一年都比去年爱我多一点。我可以没有男朋友，但我不能没有女朋友，尤其像Burning Red这样的。 2014年，12月底，大冬天，特别寒冷。我跟她说我要去大上海几天，那边比广东冷很多，我说我怕冷。她当时开始在实习公司上班了，一下班就坐公交车，急忙带着两大袋羽绒服来找我。一见面，她就马上问我：“冷么，我给你带了三件羽绒服来，三个色让你挑。”看到她那么紧张我，我开始矫情了，想哭，又想笑。这么好的人儿，我上哪找去。她打开袋子，我看到了三件羽绒服，红粉紫三种颜色。她就像个热心温和的衣服店长，很耐心地看着我把每一件衣服都试一遍，最后选择了尺度合身的粉色羽绒服。衣穿在身，我暖在心。我不知道怎么感谢她。我去上海旅行的时候，听说特色南京路步行街那有老字号知名化妆品牌上海女人，就特意给她挑了一盒精致的玫瑰味口红。这款口红，可以涂唇，也可打腮红，一物二用，携带也方便。她收到口红，挺开心的。其实，那粉色羽绒服是她男友妈妈买给她的，她说不介意给我穿，反正衣服多，就不想我冷。这件衣服，现在也还留在我这。每次穿它，我都觉得特别暖和。 2016年7月，我觉得自己快要死了。我遇到了一个坎，我没法过。然后，我生病了，一病不撅。接着，我失眠了，每天被噩梦缠绕。 所有的所有，我都必须自己强忍着，谁也没法说。一个人到了最悲伤的点，往往是无法说出口的。也许，最大的痛就是说不出口的痛。我不知道该找谁，唯一能想到的就是她。我在微信说我想她了，想她陪我吃顿饭。 我们见面是在体育西的时尚天河西区的美食区，点了OLD记茶餐厅的食物，一碗咸粥，一碗猪脚汤面，一碗有肉有菜子的饭。她吃饭，我吃面，粥混着吃。从头到尾我都在努力说最开心的事给她听，都顾不上吃面了。其实，面不好吃，我想喝面汤而点了碗面。我想极力掩饰自己难过的心而不得不像吹泡泡一样冒话，越多越快越好。她看我的眼神，懂我却欲言又止，顺手夹了块肉叫我吃。很快，她被我的话逗笑。 她说：“你这么能说这么搞笑不去当相声演员真是埋没了人才。”我说：“才没有咧，因为是你我才这么能说。”她说：“就你多花样，总爱逞强！”我说：“不，那是因为你在。”就算我去当相声演员了，我也只为她一个人而演。 每天晚上她一下班，就从番禺坐一个半多小时的车来天河体育西陪我吃饭、聊天，只想让我高兴。 我说：“路太远了，你要先坐公交后转地铁，麻烦。”她说：“去找你，我一点都不觉得远。想着你，路近了。”我说：“你白天上班这么辛苦晚上还要陪我，辛苦。”她说：“傻瓜，我只要看到你，就不觉得辛苦。”我说：“你别来了，换我去找你吧。”她说：“你是美女，太不安全了。我并不想你一个人坐那么久的车，走那么远的路，会孤单。”我说：“我对你不好，愧疚！”她说：“傻瓜，那是我愿意，愿意为你做。”她总爱说我是傻瓜，她爱我的时候样子就特傻。我挺亏欠她的，所以我打算在她生命里黏一辈子了，尽我所能对她好。 那段时间，每次见她前，我都先自己找个地哭完，擦干眼泪，再去见她。我必须装作很高兴，很好，不能让她担心。我觉得我这么坚强这么乐观这么爱美的人在她面前哭桑哀怨，一点都不酷，不像我。我想让我们的约会时间可以更美好。其实，我是怕她看见我眼泪，我怕她哭。她是个很感性的人，所以我必须理智让她笑。 所有的所有，她都知道。她是我最好的朋友，我可以毫不掩饰自己的狼狈与悲伤，因为她会装作看不见我相信我能坚强勇敢，其实我的狼狈和难堪，她都知道，但她不会对第三个人言。我想聊天了，她总如约陪我。去老地方，点同样的食物，一坐就几个钟头。那段难熬的日子，因为有她的陪伴，我才活得这么好。 宠蜜，就像这个世界上另外的一种情话，不擅于语言，但付诸行动。她每一次为我做的小细节，我都看在眼里，记在心里。每次外出，她都会备一瓶矿泉水，遇到空气闷的时候我喉咙会咳嗽，她会第一时间把水瓶盖拧开，递我水喝。我头痛不舒服，她会找位置让我坐下来，然后很贴心帮我按头部太阳穴，还会随身带药油，说为我以备不时之需。 有一次我坐地铁，特别想吐，头好痛，她没带药油，她在我面前诉训了她自己，各种懊悔。我说没事，她居然在地铁产生问别人借药油的想法，没借到。她叫我坐在那凳子休息。她一个人跑出地铁外面给我买药油，买药。我开玩笑说啥也不用给我买，给我买个袋子回来就得了，我怕我吐没东西盛。结果，她回来没有买到药油和药，果真给我买了个袋子回来，还买了一瓶清新薄荷味木糖醇口香糖给我。她说很清凉的，嚼起来让喉咙凉快，就不会吐了。看到气喘吁吁的她，我很感动，感谢老天对我不薄。后来，我嚼薄荷味的口香糖，神奇到真的不反胃了。 她会为我剥虾壳，把肉切好，递给我吃，把好吃的都留给我，每次出去吃饭都挑我喜欢吃的。我喜欢的口味，她总清楚记得。 去逛街看衣服，她自己都不舍得买贵衣服穿。可那次我看到喜欢的裙子，她就不犹豫的为我刷卡，然后豪气说我送你，你开心就好。 她觉得我身子弱，应该补补，于是给我买了养颜补血保健品零食。男朋友家做饺子了，她也会带一碗给我吃。她就是那种会宰男人不会宰我的人，对我如宝。最近，她不知道跟谁学的，她开始送我鲜花了，每周一束鲜花。 有时候，我觉得人最珍贵东西并不是那些所谓的物质，而是陪伴你的人。她，最珍贵。 她对我好，真心，懂浪漫，有比爱情还贴心的感情。在我心中，她是我的温暖。 我和Burning Red说，我喜欢大海，我想带她去看海。因为大海里有浪花和海潮。她就是浪花，而我就是海潮。 晚安，好梦。你和全世界。 ♡♡♡","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/wwjlife/tags/随笔/"}]},{"title":"花开即死亡，凋零且重生。","date":"2017-01-14T11:38:21.000Z","path":"随笔/花开即死亡，凋零且重生。/","text":"她说：“妹妹漂亮得像大家闺秀，说话好温柔，文艺女青。”我说：“还好。”她说：“妹妹年轻真好，快快乐乐的，老可爱了。”我说：“姐姐看起来一点不老。”她说：“南方的女孩都像你这样会穿衣麽？以前妹妹穿得很甜美，现在穿得时尚很潮有范，可惹人爱了。”我说：“不是的，姐姐也可以更美。” 我给她取了个英文名字Anne，善良，优雅，善解人意，热情帮助他人，很适合她。她比我大13岁，可年龄的差距并没有影响我们成为无所不畅谈的朋友，相见恨晚。Anne，是我见过最细软却又最勇敢的女人。 去年11月份，我和她一同入住上海新悦大酒店。我们一拍即合订好时间去上海外滩看夜景，准备逛逛上海街。可后来由于各种原因，各种牵制和顾及，最后都没有去成。于是，我们从苏州太仓直接打车回新悦大酒店。我们泡好澡，早早躺上床。就那种标间双人床套房，累了一天的我们，各躺一床，柔软得很舒服。我们没有睡意，也不想看电视，手机充电，就聊天，说了很多很多话。她把多年藏在心底最深处的故事说给我听。她说从来没跟人家提过，不知道为什么就想说给我听。我想，她真诚，她信任我。活在这个世界上，被人信任，就是最极致的开心。那一晚，她和我说她的感情史了。吸引女人，似乎最简单最好的方式是给她们讲你痛苦的过去。 高中的时候，Anne家境就很好，穿着如同公主，人不仅美丽，而成绩也优秀。她有一个发小，是个男孩。两人感情特别好，彼此爱慕对方，可谁也没去捅破那一层薄纸。可喜欢上一个人，用情过深，堆积越满，总有一天会由心从口而溢出。这个好像是定理，只是每个人采取处理的方式不一样。Anne，采取写信的方式告诉男孩，纸薄情深。她满怀期待，只换来男孩简单的一句：我配不上你。Anne说：“十年了，我喜欢的是他这个人，跟钱跟任何东西都没关系！”她觉得男孩不需要在意那些玩意，所以她不放弃追求男孩。 那年，男孩去了北京。她原本可以不去北京的，可男孩在那。她为了他，什么都不顾，自己一个人跑去北京找男孩。朋友们接待了她。那晚她躺在房间里睡觉，朋友们以为她累了睡着了没有叫上她聊天。她们就在厅外聊天，有聊到关于那男孩的事。她没睡着，隐隐约约听到男孩已经有女朋友了，而且还是大家认识的女孩，唯独她一直不知道。男孩不直接是因为没有勇气告诉她有女朋友了？怕她伤心不忍告诉？还是因为其他事来不及对她说？也许都有吧。十年时间的专情，她这刻心情谁能懂？那一刻就像一把螺丝刀在一刀一刀钻她的心窝，很痛很难受，又得忍。她去之前没有提前向男孩说，也没有跟朋友们说，就想给他一个大惊喜。可男一号都不在了，所有为他做的事都没有意义了，不重要了，其他的对她来说无关痛痒。后来，她离开了。 2000年，她难受，无处诉说。大晚上的，一个人跑上没有人逗留的教学楼，站在最顶处。寒风呼啸作冷，漆黑无光的环境，她都不怕了。她想跳楼却因为念及父母而没有迈出那一步，就一个人蜷缩在墙边泪如尿崩，心如刀绞。一个人成长的路上，难免偶遇心碎，总要坦然接受悲伤和失去，好像不溅点血，都不叫人生。后来，发小和那个女孩结婚了。她，祝福发小。从头到尾，她都没有吵过，很安静，温顺得让人十分心疼。 有人说，让一个人走出前任的悲痛，无非就两种：时间和新欢。如果不行，那只能怪时间不够长，新欢不够好。大学期间，Anne又恋爱了，做着所有恋人都会做的幸福事。她说那段日子里很开心，因为男生对她好。男生就像阳光，晒掉了她的所有不值得的悲伤。 还没毕业，在她完全没有准备的情况下，男生草率地带了她回家见了家长。在这之前，男生并没有和她商量过。女生第一次见家长，会特别紧张，很重视却不知所措。无论是着装还是言语举止，稍有不好，印象分大跌，家长会不喜欢的。男生好像从来没考虑过女生在这方面的感受，完全惯着自己的心意来。我想带回家就带回家，反正是我爱的人，父母会喜欢的。可男生有时候就是太高估了自己，从而低估了父母对自己的择偶要求，受到伤害的总是女生。是的，男生父母并不喜欢Anne，根本不会让她有当儿媳妇的机会。男生父母早已经安排了一个相亲的女孩，那女孩家境特别好，高官贵人，在物质上可以给予男方更多。父母要求男生和那相亲女孩结婚，说这一切都是为了男生的未来好。很多人会说，男生如果够爱女生，就去和父母协商努力争取在一起，毕竟两个能相爱不容易。公平的想法是这样的，可在这个社会公平的秩序里必须接受不公平的事实，那就是天底下并不是所有的父母都能做到深明大义，都能理解自己的子女。男生愿意去与父母协商，不同意，争执吵架，周旋得毫无招数招架住。最终，男生妈妈以死来要挟他。男生再爱她，也无法忍心将自己亲生父母的生死扔在一边完全不顾。这不是孝顺，而是亲情被逼绑架而不得不去做的事。 这一切，Anne看在眼里，痛在心里。她爱他，可并不是那种夹带着亲人生死威胁的自私爱，更不想让他夹在中间难受。于是，他们彼此共同商量决定分手。男生在父母的强逼下娶了相亲的女孩。第二年，他们就生了个孩子。可男生根本不爱那女孩，两年来过得并不好。 2003年，Anne得了抑郁症。她把整颗心都掏给了男生，一无所有。一个人的心就好像宝库，一下子掏空了，就会破产。沉重的打击，让她彻底崩溃了，生无可恋。她把自己关在黑暗不见光的房子里，不见任何人，不吃饭不洗澡，对所有的事物都失去兴趣，每天等死的节奏。这种感觉，就像骨架被抽走了，只剩下一摊肉。实在饿了，受不住了，她晚上就去厨房冰箱那一拿些馒头回房啃。漫长的夜里，每天也只有冰冷的馒头肯与她相伴。家人也劝过，说教过，一切都无济于事。难过就是难过，所有的安慰都显得没用。以前Anne的妹妹觉得她美丽自信懂事，会很甜蜜很亲昵地叫她姐姐。可看到现在暗淡无光自暴自弃身体发臭头发凌乱的她，从那一刻起再也没叫过她一声姐姐了。Anne对第二任花光了自己所有的感情，就像把存款花光了一样得不到人家的原谅。 半年后，她突然想看到阳光，拉开窗帘的那一刻，眼睛刺得睁不开。这是她躲在黑暗房子那么久之后，第一次感受到阳光的温暖。虚空极尽莫能计，每心旁总有情长，人随水去泪汪汪，唯见阳光满希望。她开始出去接触人，发现自己没有了朋友。她想与人沟通，发现自己失声了，不会说话了。她心里并没有完全放下第二任，但她不想再荒废人生，她想重拾生活的信心，感受美好的事物。她开始重新学说话，重新做事情，就期待一天能变好。后来，她去了上海工作。 每次出差到一个城市，她都会去电话亭打一个电话给第二任，不说话，就是为了听到他“喂”的那一声熟悉的声音，然后挂掉。所有传闻里陈词滥调的故事，你不见了，我才如此想念。她说，她习惯了打电话给他。一个人坐车，一个人喝酒，一个人哭着把故事往肚里咽，一个人整夜不睡觉睁眼看着天由暗变亮。她害怕黑夜，她也知道不管多害怕，终究有一天还是要醒来。 Anne说，第二任去过上海找过她，在上海霓虹红绿灯大街大吵过，两人就那样坐在路边嚎啕大哭。男生离婚了。他诉说没有她的日子里，没法过好。他后悔了。 Anne说，她当初就认定第二任是她这辈子对的人，是能给她永久心安的人。她叹气说：“感情，不是一人惜，而是两人守。”对于第二任的百般请求，她说换做以前会答应，可现在不会了。过去的回不来，只有一路向前。 其实，不止第二任过得不好，就连发小也后悔了。后来发小也跟她联系过。发小当初也喜欢她，只是觉得自己无论家境还是外貌都配不上，并不想伤害她。他觉得公主就该配王子，像他这样的普通骑士只适合出现在公主需要帮忙的时刻，一辈子的伴侣根本不敢高攀。错过好的女孩，男生就算悔恨，也晚了。 再后来，Anne也谈过两三次感情，可都没如她所愿。不是说Anne不好，或者忘不了谁，她很清楚自己需要什么，所以情愿宁缺勿滥。每个女孩的情感史都像一部剧，有男一号，有男二号，或者有备胎。女孩在戏里总会认真用心努力去演好女主角的角色，可并不是所有的结局都如人所愿。好的剧总能让人记很久，不好的剧总有一天会慢慢会淡出人的记忆，甚至遗忘它。从Anne的身上，我感觉会学到很多。得不到的就不要，不是好的就扔掉，我们应该在薄情的世界里，深情地活着。 她静静地向我说着她的故事，温和细语，并报以微笑。她是个柔软的人，我喜欢和她交谈。一个人之所以变得柔软，一定是她懂得了理解和宽容。对于自己不曾了解的事情学会的缄默，而不是横亘大吵用恶言相对，哪怕是不同意许多事情，但也学会了站在对方的立场上想问题。没有了非此即彼，非黑即白的执拗，学会了打开心胸，不止对现在，也对过去那些曾经难以搁置的顽念，学会了释怀。从头到尾她都没有指责过任何伤害过她的男生，她说站在对方的立场上想想，就会理解，心里就会坦然了，也就没那么难受了。我想，一个人不应该只会忍让，忍到无法再忍就会自燃爆炸，搞不好就会殃及他人。人应该学会包容，包容能让大家走得更远。 听完Anne的故事，我觉得那些说不再相信爱情的人有点搞笑。因为心有繁花，才满眼春色呀。我笑着说：“姐姐这么好，你会遇到对的那个人，不是一时强烈的心动，而是永久的心安。”Anne说：“我现在祈求活着就不错了！哈哈，不过，能再有爱情好像也不错，总会有的。”有些时候人必须要做自己的英雄，就像你以为那些说离不开你的人并不是真的离不开你，当某天他们真的离开你以后当你经历过这些伤痛以后，待人真诚以及拥有继续珍惜爱人的能力，这就是最勇敢的。这，就像Anne一样的勇敢。 Anne虽然还没等到爱情，可她现在的日子过得如花一样。她有很多朋友，城里城外的，省内省外的，国内国外的，不再孤单一人了，起码有朋友的陪伴。在很多人眼里，她是个大龄剩女。可她没有为此烦恼，她认为人就该活在当下好好享受生活就足够了。过去回不去，未来无法预测，只有当下才是最真实的。当然，她能活得这么好，都离不开一个好家庭的支持与爱护。Anne很爱她的爸爸，因为她爸爸很尊重她，从来不给她施加任何压力，只要她开心就好。一个父亲能把女儿照顾得像花一样，倾心尽情呵护，维持花的美好，一定是上辈子的情人。 Anne喜欢柔和粉色的鲜花，屋子里总有一束。平时没事，总爱罢弄一些小盆栽植物。她爱花，也养花，别致，高雅，性情温和，贤淑。白岩松曾说：“生活5％是幸福的，5%是痛苦的，剩余的90％是平淡的。”就像Anne的性格注定她成不了什么女强人，但她有自己的思想，能保持自己的原态，不被各种束缚“优化”。美丽的容颜会老去，但养花的女人，随着时间的流逝，心不会变老，只会沉淀出更多的成熟，更丰富的体验，更深刻的思想。我很喜欢她的那种与世无忧的生活状态，拥有少女心。毕竟，在浮躁的社会中能够沉淀自己平静内心的人并不多了。 除此以外，她很喜欢收藏高脚酒杯。懂喝酒的人都会知道一个常识，高脚酒杯是用来盛放红酒或者香槟酒的，而这种酒杯最能展示女人手部优美的线条。以前我从不喝酒的，可我也喜欢上了红酒，因为走心的高脚酒杯，情调，高雅。闲时，她会喝点酒，做做菜，看看书，也会宅在家看戏子。内心充盈的女人，总能把生活过成诗。 我和Anne年认识两年多了。她叫我妹妹，我叫她姐姐。她在北京，我在广州。她说我笑得可爱，我说她活得漂亮。 她，就像一朵不老的花。我认识的Anne，即使凋零死了，也会重生得很美丽。 晚安，好梦。你，和全世界。♡♡♡","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/wwjlife/tags/随笔/"},{"name":"游记","slug":"游记","permalink":"https://github.com/wwjlife/tags/游记/"},{"name":"吃货","slug":"吃货","permalink":"https://github.com/wwjlife/tags/吃货/"},{"name":"教程","slug":"教程","permalink":"https://github.com/wwjlife/tags/教程/"},{"name":"小故事","slug":"小故事","permalink":"https://github.com/wwjlife/tags/小故事/"}]}]