[{"title":"花开即死亡，凋零且重生。","date":"2017-01-14T11:38:21.000Z","path":"随笔/花开即死亡，凋零且重生。/","text":"#花开即死亡，凋零且重生。她说：“妹妹漂亮得像大家闺秀，说话好温柔，文艺女青。”我说：“还好。”她说：“妹妹年轻真好，快快乐乐的，老可爱了。”我说：“姐姐看起来一点不老。”她说：“南方的女孩都像你这样会穿衣麽？以前妹妹穿得很甜美，现在穿得时尚很潮有范，可惹人爱了。”我说：“不是的，姐姐也可以更美。” 我给她取了个英文名字Anne，善良，优雅，善解人意，热情帮助他人，很适合她。她比我大13岁，可年龄的差距并没有影响我们成为无所不畅谈的朋友，相见恨晚。Anne，是我见过最细软却又最勇敢的女人。 去年11月份，我和她一同入住上海新悦大酒店。我们一拍即合订好时间去上海外滩看夜景，准备逛逛上海街。可后来由于各种原因，各种牵制和顾及，最后都没有去成。于是，我们从苏州太仓直接打车回新悦大酒店。我们泡好澡，早早躺上床。就那种标间双人床套房，累了一天的我们，各躺一床，柔软得很舒服。我们没有睡意，也不想看电视，手机充电，就聊天，说了很多很多话。她把多年藏在心底最深处的故事说给我听。她说从来没跟人家提过，不知道为什么就想说给我听。我想，她真诚，她信任我。活在这个世界上，被人信任，就是最极致的开心。那一晚，她和我说她的感情史了。吸引女人，似乎最简单最好的方式是给她们讲你痛苦的过去。 高中的时候，Anne家境就很好，穿着如同公主，人不仅美丽，而成绩也优秀。她有一个发小，是个男孩。两人感情特别好，彼此爱慕对方，可谁也没去捅破那一层薄纸。可喜欢上一个人，用情过深，堆积越满，总有一天会由心从口而溢出。这个好像是定理，只是每个人采取处理的方式不一样。Anne，采取写信的方式告诉男孩，纸薄情深。她满怀期待，只换来男孩简单的一句：我配不上你。Anne说：“十年了，我喜欢的是他这个人，跟钱跟任何东西都没关系！”她觉得男孩不需要在意那些玩意，所以她不放弃追求男孩。 那年，男孩去了北京。她原本可以不去北京的，可男孩在那。她为了他，什么都不顾，自己一个人跑去北京找男孩。朋友们接待了她。那晚她躺在房间里睡觉，朋友们以为她累了睡着了没有叫上她聊天。她们就在厅外聊天，有聊到关于那男孩的事。她没睡着，隐隐约约听到男孩已经有女朋友了，而且还是大家认识的女孩，唯独她一直不知道。男孩不直接是因为没有勇气告诉她有女朋友了？怕她伤心不忍告诉？还是因为其他事来不及对她说？也许都有吧。十年时间的专情，她这刻心情谁能懂？那一刻就像一把螺丝刀在一刀一刀钻她的心窝，很痛很难受，又得忍。她去之前没有提前向男孩说，也没有跟朋友们说，就想给他一个大惊喜。可男一号都不在了，所有为他做的事都没有意义了，不重要了，其他的对她来说无关痛痒。后来，她离开了。 2000年，她难受，无处诉说。大晚上的，一个人跑上没有人逗留的教学楼，站在最顶处。寒风呼啸作冷，漆黑无光的环境，她都不怕了。她想跳楼却因为念及父母而没有迈出那一步，就一个人蜷缩在墙边泪如尿崩，心如刀绞。一个人成长的路上，难免偶遇心碎，总要坦然接受悲伤和失去，好像不溅点血，都不叫人生。后来，发小和那个女孩结婚了。她，祝福发小。从头到尾，她都没有吵过，很安静，温顺得让人十分心疼。 有人说，让一个人走出前任的悲痛，无非就两种：时间和新欢。如果不行，那只能怪时间不够长，新欢不够好。大学期间，Anne又恋爱了，做着所有恋人都会做的幸福事。她说那段日子里很开心，因为男生对她好。男生就像阳光，晒掉了她的所有不值得的悲伤。 还没毕业，在她完全没有准备的情况下，男生草率地带了她回家见了家长。在这之前，男生并没有和她商量过。女生第一次见家长，会特别紧张，很重视却不知所措。无论是着装还是言语举止，稍有不好，印象分大跌，家长会不喜欢的。男生好像从来没考虑过女生在这方面的感受，完全惯着自己的心意来。我想带回家就带回家，反正是我爱的人，父母会喜欢的。可男生有时候就是太高估了自己，从而低估了父母对自己的择偶要求，受到伤害的总是女生。是的，男生父母并不喜欢Anne，根本不会让她有当儿媳妇的机会。男生父母早已经安排了一个相亲的女孩，那女孩家境特别好，高官贵人，在物质上可以给予男方更多。父母要求男生和那相亲女孩结婚，说这一切都是为了男生的未来好。很多人会说，男生如果够爱女生，就去和父母协商努力争取在一起，毕竟两个能相爱不容易。公平的想法是这样的，可在这个社会公平的秩序里必须接受不公平的事实，那就是天底下并不是所有的父母都能做到深明大义，都能理解自己的子女。男生愿意去与父母协商，不同意，争执吵架，周旋得毫无招数招架住。最终，男生妈妈以死来要挟他。男生再爱她，也无法忍心将自己亲生父母的生死扔在一边完全不顾。这不是孝顺，而是亲情被逼绑架而不得不去做的事。 这一切，Anne看在眼里，痛在心里。她爱他，可并不是那种夹带着亲人生死威胁的自私爱，更不想让他夹在中间难受。于是，他们彼此共同商量决定分手。男生在父母的强逼下娶了相亲的女孩。第二年，他们就生了个孩子。可男生根本不爱那女孩，两年来过得并不好。 2003年，Anne得了抑郁症。她把整颗心都掏给了男生，一无所有。一个人的心就好像宝库，一下子掏空了，就会破产。沉重的打击，让她彻底崩溃了，生无可恋。她把自己关在黑暗不见光的房子里，不见任何人，不吃饭不洗澡，对所有的事物都失去兴趣，每天等死的节奏。这种感觉，就像骨架被抽走了，只剩下一摊肉。实在饿了，受不住了，她晚上就去厨房冰箱那一拿些馒头回房啃。漫长的夜里，每天也只有冰冷的馒头肯与她相伴。家人也劝过，说教过，一切都无济于事。难过就是难过，所有的安慰都显得没用。以前Anne的妹妹觉得她美丽自信懂事，会很甜蜜很亲昵地叫她姐姐。可看到现在暗淡无光自暴自弃身体发臭头发凌乱的她，从那一刻起再也没叫过她一声姐姐了。Anne对第二任花光了自己所有的感情，就像把存款花光了一样得不到人家的原谅。 半年后，她突然想看到阳光，拉开窗帘的那一刻，眼睛刺得睁不开。这是她躲在黑暗房子那么久之后，第一次感受到阳光的温暖。虚空极尽莫能计，每心旁总有情长，人随水去泪汪汪，唯见阳光满希望。她开始出去接触人，发现自己没有了朋友。她想与人沟通，发现自己失声了，不会说话了。她心里并没有完全放下第二任，但她不想再荒废人生，她想重拾生活的信心，感受美好的事物。她开始重新学说话，重新做事情，就期待一天能变好。后来，她去了上海工作。 每次出差到一个城市，她都会去电话亭打一个电话给第二任，不说话，就是为了听到他“喂”的那一声熟悉的声音，然后挂掉。所有传闻里陈词滥调的故事，你不见了，我才如此想念。她说，她习惯了打电话给他。一个人坐车，一个人喝酒，一个人哭着把故事往肚里咽，一个人整夜不睡觉睁眼看着天由暗变亮。她害怕黑夜，她也知道不管多害怕，终究有一天还是要醒来。 Anne说，第二任去过上海找过她，在上海霓虹红绿灯大街大吵过，两人就那样坐在路边嚎啕大哭。男生离婚了。他诉说没有她的日子里，没法过好。他后悔了。 Anne说，她当初就认定第二任是她这辈子对的人，是能给她永久心安的人。她叹气说：“感情，不是一人惜，而是两人守。”对于第二任的百般请求，她说换做以前会答应，可现在不会了。过去的回不来，只有一路向前。 其实，不止第二任过得不好，就连发小也后悔了。后来发小也跟她联系过。发小当初也喜欢她，只是觉得自己无论家境还是外貌都配不上，并不想伤害她。他觉得公主就该配王子，像他这样的普通骑士只适合出现在公主需要帮忙的时刻，一辈子的伴侣根本不敢高攀。错过好的女孩，男生就算悔恨，也晚了。 再后来，Anne也谈过两三次感情，可都没如她所愿。不是说Anne不好，或者忘不了谁，她很清楚自己需要什么，所以情愿宁缺勿滥。每个女孩的情感史都像一部剧，有男一号，有男二号，或者有备胎。女孩在戏里总会认真用心努力去演好女主角的角色，可并不是所有的结局都如人所愿。好的剧总能让人记很久，不好的剧总有一天会慢慢会淡出人的记忆，甚至遗忘它。从Anne的身上，我感觉会学到很多。得不到的就不要，不是好的就扔掉，我们应该在薄情的世界里，深情地活着。 她静静地向我说着她的故事，温和细语，并报以微笑。她是个柔软的人，我喜欢和她交谈。一个人之所以变得柔软，一定是她懂得了理解和宽容。对于自己不曾了解的事情学会的缄默，而不是横亘大吵用恶言相对，哪怕是不同意许多事情，但也学会了站在对方的立场上想问题。没有了非此即彼，非黑即白的执拗，学会了打开心胸，不止对现在，也对过去那些曾经难以搁置的顽念，学会了释怀。从头到尾她都没有指责过任何伤害过她的男生，她说站在对方的立场上想想，就会理解，心里就会坦然了，也就没那么难受了。我想，一个人不应该只会忍让，忍到无法再忍就会自燃爆炸，搞不好就会殃及他人。人应该学会包容，包容能让大家走得更远。 听完Anne的故事，我觉得那些说不再相信爱情的人有点搞笑。因为心有繁花，才满眼春色呀。我笑着说：“姐姐这么好，你会遇到对的那个人，不是一时强烈的心动，而是永久的心安。”Anne说：“我现在祈求活着就不错了！哈哈，不过，能再有爱情好像也不错，总会有的。”有些时候人必须要做自己的英雄，就像你以为那些说离不开你的人并不是真的离不开你，当某天他们真的离开你以后当你经历过这些伤痛以后，待人真诚以及拥有继续珍惜爱人的能力，这就是最勇敢的。这，就像Anne一样的勇敢。 Anne虽然还没等到爱情，可她现在的日子过得如花一样。她有很多朋友，城里城外的，省内省外的，国内国外的，不再孤单一人了，起码有朋友的陪伴。在很多人眼里，她是个大龄剩女。可她没有为此烦恼，她认为人就该活在当下好好享受生活就足够了。过去回不去，未来无法预测，只有当下才是最真实的。当然，她能活得这么好，都离不开一个好家庭的支持与爱护。Anne很爱她的爸爸，因为她爸爸很尊重她，从来不给她施加任何压力，只要她开心就好。一个父亲能把女儿照顾得像花一样，倾心尽情呵护，维持花的美好，一定是上辈子的情人。 Anne喜欢柔和粉色的鲜花，屋子里总有一束。平时没事，总爱罢弄一些小盆栽植物。她爱花，也养花，别致，高雅，性情温和，贤淑。白岩松曾说：“生活5％是幸福的，5%是痛苦的，剩余的90％是平淡的。”就像Anne的性格注定她成不了什么女强人，但她有自己的思想，能保持自己的原态，不被各种束缚“优化”。美丽的容颜会老去，但养花的女人，随着时间的流逝，心不会变老，只会沉淀出更多的成熟，更丰富的体验，更深刻的思想。我很喜欢她的那种与世无忧的生活状态，拥有少女心。毕竟，在浮躁的社会中能够沉淀自己平静内心的人并不多了。 除此以外，她很喜欢收藏高脚酒杯。懂喝酒的人都会知道一个常识，高脚酒杯是用来盛放红酒或者香槟酒的，而这种酒杯最能展示女人手部优美的线条。以前我从不喝酒的，可我也喜欢上了红酒，因为走心的高脚酒杯，情调，高雅。闲时，她会喝点酒，做做菜，看看书，也会宅在家看戏子。内心充盈的女人，总能把生活过成诗。 我和Anne年认识两年多了。她叫我妹妹，我叫她姐姐。她在北京，我在广州。她说我笑得可爱，我说她活得漂亮。 她，就像一朵不老的花。我认识的Anne，即使凋零死了，也会重生得很美丽。 晚安，好梦。你，和全世界。♡♡♡","tags":[{"name":"随笔","slug":"随笔","permalink":"https://github.com/wwjlife/tags/随笔/"}]},{"title":"abd","date":"2017-01-07T07:38:21.000Z","path":"小故事/adb/","text":"abd: command not found.md 在Mac系统中，第一次在Android SDK中使用adb的时候回无法使用。提示-bash: abd: command not found。原因是：未配置Android的环境变量。因此，您需为Mac中的Android SDK配置环境变量。 启动Mac自带的终端Terminal。 进入当前用户的根目录。// 比如我的/Users/y*i/ 用vim打开「创建」.bash_profile文件。 输入export PATH=${PATH}:/Users/yi/Library/Android/sdk/platform-tools:/Users/yi/Library/Android/sdk/tools并保存就可以了 注意：如果需要添加多个路径到PATH下时，需要用“:”(英文的冒号)隔开。 更新刚配置的环境变量 在命令行中输入source .bash_profile 验证配置是否成功输入adb，如果没有出现-bash: adb: command not found；而出现adb的命令参数解释。则表明环境变量配置成功。 电脑重启以后adb命令就不能用了，需要touch 一下，怎么破 在.zshrc中添加一行：source ~/.bash_profile","tags":[{"name":"bug","slug":"bug","permalink":"https://github.com/wwjlife/tags/bug/"},{"name":"android","slug":"android","permalink":"https://github.com/wwjlife/tags/android/"},{"name":"meteor","slug":"meteor","permalink":"https://github.com/wwjlife/tags/meteor/"},{"name":"小故事","slug":"小故事","permalink":"https://github.com/wwjlife/tags/小故事/"}]},{"title":"Markdown教程","date":"2017-01-07T07:38:21.000Z","path":"教程/Markdown教程/","text":"欢迎使用 Cmd Markdown 编辑阅读器 我们理解您需要更便捷更高效的工具记录思想，整理笔记、知识，并将其中承载的价值传播给他人，Cmd Markdown 是我们给出的答案 —— 我们为记录思想和分享知识提供更专业的工具。 您可以使用 Cmd Markdown： 整理知识，学习笔记 发布日记，杂文，所见所想 撰写发布技术文稿（代码支持） 撰写发布学术论文（LaTeX 公式支持） 除了您现在看到的这个 Cmd Markdown 在线版本，您还可以前往以下网址下载： Windows/Mac/Linux 全平台客户端 请保留此份 Cmd Markdown 的欢迎稿兼使用说明，如需撰写新稿件，点击顶部工具栏右侧的 新文稿 或者使用快捷键 Ctrl+Alt+N。 什么是 MarkdownMarkdown 是一种方便记忆、书写的纯文本标记语言，用户可以使用这些标记符号以最小的输入代价生成极富表现力的文档：譬如您正在阅读的这份文档。它使用简单的符号标记不同的标题，分割不同的段落，粗体 或者 斜体 某些文字，更棒的是，它还可以 1. 制作一份待办事宜 Todo 列表 [ ] 支持以 PDF 格式导出文稿 [ ] 改进 Cmd 渲染算法，使用局部渲染技术提高渲染效率 [x] 新增 Todo 列表功能 [x] 修复 LaTex 公式渲染问题 [x] 新增 LaTex 公式编号功能 2. 书写一个质能守恒公式[^LaTeX]$$E=mc^2$$ 3. 高亮一段代码[^code]1234567@requires_authorizationclass SomeClass: passif __name__ == '__main__': # A comment print 'hello world' 4. 高效绘制 流程图12345678st=&gt;start: Startop=&gt;operation: Your Operationcond=&gt;condition: Yes or No?e=&gt;endst-&gt;op-&gt;condcond(yes)-&gt;econd(no)-&gt;op 5. 高效绘制 序列图123Alice-&gt;Bob: Hello Bob, how are you?Note right of Bob: Bob thinksBob--&gt;Alice: I am good thanks! 6. 高效绘制 甘特图12345678910111213title 项目开发流程section 项目确定 需求分析 :a1, 2016-06-22, 3d 可行性报告 :after a1, 5d 概念验证 : 5dsection 项目实施 概要设计 :2016-07-05 , 5d 详细设计 :2016-07-08, 10d 编码 :2016-07-15, 10d 测试 :2016-07-22, 5dsection 发布验收 发布: 2d 验收: 3d 7. 绘制表格 项目 价格 数量 计算机 \\$1600 5 手机 \\$12 12 管线 \\$1 234 8. 更详细语法说明想要查看更详细的语法说明，可以参考我们准备的 Cmd Markdown 简明语法手册，进阶用户可以参考 Cmd Markdown 高阶语法手册 了解更多高级功能。 总而言之，不同于其它 所见即所得 的编辑器：你只需使用键盘专注于书写文本内容，就可以生成印刷级的排版格式，省却在键盘和工具栏之间来回切换，调整内容和格式的麻烦。Markdown 在流畅的书写和印刷级的阅读体验之间找到了平衡。 目前它已经成为世界上最大的技术分享网站 GitHub 和 技术问答网站 StackOverFlow 的御用书写格式。 什么是 Cmd Markdown您可以使用很多工具书写 Markdown，但是 Cmd Markdown 是这个星球上我们已知的、最好的 Markdown 工具——没有之一 ：）因为深信文字的力量，所以我们和你一样，对流畅书写，分享思想和知识，以及阅读体验有极致的追求，我们把对于这些诉求的回应整合在 Cmd Markdown，并且一次，两次，三次，乃至无数次地提升这个工具的体验，最终将它演化成一个 编辑/发布/阅读 Markdown 的在线平台——您可以在任何地方，任何系统/设备上管理这里的文字。 1. 实时同步预览我们将 Cmd Markdown 的主界面一分为二，左边为编辑区，右边为预览区，在编辑区的操作会实时地渲染到预览区方便查看最终的版面效果，并且如果你在其中一个区拖动滚动条，我们有一个巧妙的算法把另一个区的滚动条同步到等价的位置，超酷！ 2. 编辑工具栏也许您还是一个 Markdown 语法的新手，在您完全熟悉它之前，我们在 编辑区 的顶部放置了一个如下图所示的工具栏，您可以使用鼠标在工具栏上调整格式，不过我们仍旧鼓励你使用键盘标记格式，提高书写的流畅度。 3. 编辑模式完全心无旁骛的方式编辑文字：点击 编辑工具栏 最右侧的拉伸按钮或者按下 Ctrl + M，将 Cmd Markdown 切换到独立的编辑模式，这是一个极度简洁的写作环境，所有可能会引起分心的元素都已经被挪除，超清爽！ 4. 实时的云端文稿为了保障数据安全，Cmd Markdown 会将您每一次击键的内容保存至云端，同时在 编辑工具栏 的最右侧提示 已保存 的字样。无需担心浏览器崩溃，机器掉电或者地震，海啸——在编辑的过程中随时关闭浏览器或者机器，下一次回到 Cmd Markdown 的时候继续写作。 5. 离线模式在网络环境不稳定的情况下记录文字一样很安全！在您写作的时候，如果电脑突然失去网络连接，Cmd Markdown 会智能切换至离线模式，将您后续键入的文字保存在本地，直到网络恢复再将他们传送至云端，即使在网络恢复前关闭浏览器或者电脑，一样没有问题，等到下次开启 Cmd Markdown 的时候，她会提醒您将离线保存的文字传送至云端。简而言之，我们尽最大的努力保障您文字的安全。 6. 管理工具栏为了便于管理您的文稿，在 预览区 的顶部放置了如下所示的 管理工具栏： 通过管理工具栏可以： 发布：将当前的文稿生成固定链接，在网络上发布，分享 新建：开始撰写一篇新的文稿 删除：删除当前的文稿 导出：将当前的文稿转化为 Markdown 文本或者 Html 格式，并导出到本地 列表：所有新增和过往的文稿都可以在这里查看、操作 模式：切换 普通/Vim/Emacs 编辑模式 7. 阅读工具栏 通过 预览区 右上角的 阅读工具栏，可以查看当前文稿的目录并增强阅读体验。 工具栏上的五个图标依次为： 目录：快速导航当前文稿的目录结构以跳转到感兴趣的段落 视图：互换左边编辑区和右边预览区的位置 主题：内置了黑白两种模式的主题，试试 黑色主题，超炫！ 阅读：心无旁骛的阅读模式提供超一流的阅读体验 全屏：简洁，简洁，再简洁，一个完全沉浸式的写作和阅读环境 8. 阅读模式在 阅读工具栏 点击 或者按下 Ctrl+Alt+M 随即进入独立的阅读模式界面，我们在版面渲染上的每一个细节：字体，字号，行间距，前背景色都倾注了大量的时间，努力提升阅读的体验和品质。 9. 标签、分类和搜索在编辑区任意行首位置输入以下格式的文字可以标签当前文档： 标签： 未分类 标签以后的文稿在【文件列表】（Ctrl+Alt+F）里会按照标签分类，用户可以同时使用键盘或者鼠标浏览查看，或者在【文件列表】的搜索文本框内搜索标题关键字过滤文稿，如下图所示： 10. 文稿发布和分享在您使用 Cmd Markdown 记录，创作，整理，阅读文稿的同时，我们不仅希望它是一个有力的工具，更希望您的思想和知识通过这个平台，连同优质的阅读体验，将他们分享给有相同志趣的人，进而鼓励更多的人来到这里记录分享他们的思想和知识，尝试点击 (Ctrl+Alt+P) 发布这份文档给好友吧！ 再一次感谢您花费时间阅读这份欢迎稿，点击 (Ctrl+Alt+N) 开始撰写新的文稿吧！祝您在这里记录、阅读、分享愉快！ 作者 @ghosert2016 年 07月 07日 [^LaTeX]: 支持 LaTeX 编辑显示支持，例如：$\\sum_{i=1}^n a_i=0$， 访问 MathJax 参考更多使用方法。 [^code]: 代码高亮功能支持包括 Java, Python, JavaScript 在内的，四十一种主流编程语言。","tags":[{"name":"小故事","slug":"小故事","permalink":"https://github.com/wwjlife/tags/小故事/"},{"name":"随笔","slug":"随笔","permalink":"https://github.com/wwjlife/tags/随笔/"},{"name":"游记","slug":"游记","permalink":"https://github.com/wwjlife/tags/游记/"},{"name":"吃货","slug":"吃货","permalink":"https://github.com/wwjlife/tags/吃货/"},{"name":"教程","slug":"教程","permalink":"https://github.com/wwjlife/tags/教程/"}]},{"title":"File操作","date":"2015-12-16T07:38:21.000Z","path":"小故事/File操作/","text":"获取总根1234File[] fileList=File.listRoots(); //返回fileList.length为1 //fileList.getAbsolutePath()为\"/\" //这就是系统的总根 打开总根目录12345File file=new File(\"/\"); File[] fileList=file.listFiles(); //获取的目录中除了\"/sdcard\"和\"/system\"还有\"/data\"、\"/cache\"、\"/dev\"等//Android的根目录并不像Symbian系统那样分为C盘、D盘、E盘等 //Android是基于Linux的，只有目录，无所谓盘符 ###获取系统存储根目录 1234File file=Environment.getRootDirectory();//File file=new File(\"/system\"); File[] fileList=file.listFiles(); //这里说的系统仅仅指\"/system\" //不包括外部存储的手机存储的范围远远大于所谓的系统存储 ###获取SD卡存储根目录 123456File file=Environment.getExternalStorageDirectory();//File file=new File(\"/sdcard\"); File[] fileList=file.listFiles(); //要获取SD卡首先要确认SD卡是否装载 boolean is=Environment.getExternalStorageState().equals(Environment.MEDIA_MOUNTED); //如果true，则已装载 //如果false，则未装载 ###获取data根目录 123File file=Environment.getDataDirectory();//File file=new File(\"/data\"); File[] fileList=file.listFiles(); //由于data文件夹是android里一个非常重要的文件夹，所以一般权限是无法获取到文件的，即fileList.length返回为0 ###获取私有文件路径 1234567Context context=this;//首先，在Activity里获取context File file=context.getFilesDir(); String path=file.getAbsolutePath(); //此处返回的路劲为/data/data/包/files，其中的包就是我们建立的主Activity所在的包 //我们可以看到这个路径也是在data文件夹下 //程序本身是可以对自己的私有文件进行操作 //程序中很多私有的数据会写入到私有文件路径下，这也是android为什么对data数据做保护的原因之一 ###获取文件（夹）绝对路径、相对路劲、文件（夹）名、父目录 12345File file=…… String relativePath=file.getPath();//相对路径 String absolutePath=file.getAbsolutePath();//绝对路径 String fileName=file.getName();//文件（夹）名 String parentPath=file.getParent();//父目录 ###列出文件夹下的所有文件和文件夹 12File file=…… File[] fileList=file.listFiles(); ###判断是文件还是文件夹 12File file=…… boolean is=file.isDirectory();//true-是，false-否 ###判断文件（夹）是否存在 12File file=…… boolean is=file.exists();//true-是，false-否 ###新建文件（夹） 1234567891011121314151617181920212223File file=…… oolean is=file.isDirectory();//判断是否为文件夹 /*方法1*/ if(is)&#123; String path=file.getAbsolutePath(); String name=\"ABC\";//你要新建的文件夹名或者文件名 String pathx=path+name; File filex=new File(pathx); boolean is=filex.exists();//判断文件（夹）是否存在 if(!is)&#123; filex.mkdir();//创建文件夹 //filex.createNewFile();//创建文件 &#125; /*方法2*/ if(is)&#123; String path=file.getAbsolutePath(); String name=\"test.txt\";//你要新建的文件夹名或者文件名 File filex=new File(path,name);//方法1和方法2的区别在于此 boolean is=filex.exists();//判断文件（夹）是否存在 if(!is)&#123; filex.mkdir();//创建文件夹 //filex.createNewFile();//创建文件 &#125; ###重命名文件（夹） 12345File file=…… String parentPath=file.getParent(); String newName=\"name\";//重命名后的文件或者文件夹名 File filex=new File(parentPath,newName);//File filex=new File(parentPaht+newName) file.renameTo(filex); ###删除文件（夹） 123File file=…… file.delete();//立即删除 //file.deleteOnExit();//程序退出后删除，只有正常退出才会删除 原地址：Android入门之文件系统操作（二）文件操作相关指令 ###view plainprint? Android 2.3提供一个称为严苛模式（StrictMode）的调试特性 唯一一篇讲到在2.3之前要怎么处理的文章","tags":[{"name":"File","slug":"File","permalink":"https://github.com/wwjlife/tags/File/"},{"name":"Android","slug":"Android","permalink":"https://github.com/wwjlife/tags/Android/"}]}]